; domain
(define (domain minotaur-maze)

  (:requirements 
    :adl
  )

  (:types
    tile - tile
    key - object
    bomb - object
    object
    player - agent
    minotaur - agent
    agent
  )

  (:predicates
    (atTile ?agent - agent ?tile - tile)
    (neighbour ?tile1 - tile ?tile2 - tile)
    (visited ?tile - tile)
    (tileSafe ?tile - tile)
    (objectOnMap ?object - object ?tile - tile)
    (haveObject ?object - object)
    (passage ?tile1 - tile ?tile2 - tile)
    (isAlive ?agent - agent)
  ) 

  (:action moveTo
  	;; Move jogador (?player) do tile de origem (?from) para o tile de destino (?to)
    ;; somente se os tiles foram vizinhos e o minotauro não esteja no destino
    :parameters   (?player - player ?from - tile ?to - tile ?minotaur - minotaur)
    :precondition (and  (atTile ?player ?from) (neighbour ?from ?to)
                        (or (not (isAlive ?minotaur))
                            (not (atTile ?minotaur ?to))
                        )
                  )
    :effect (and  (not (atTile ?player ?from))
                  (atTile ?player ?to)
                  (when (not(visited ?to)) (visited ?to)) 
            )
  )

  (:action pick
    ;; Pega o ?objeto que está no tile ?location
    :parameters   (?player - player ?object - object ?location - tile)
    :precondition (and (atTile ?player ?location) (objectOnMap ?object ?location))
    :effect (and  (not (objectOnMap ?object ?location))
                  (haveObject ?object)
            )
  )

  (:action usePassage
    ;; Usa passagem do tile de origem (?from) para o destino (?to)
    ;; não é obrigatórioos tiles serem vizinhos (teleporte)
    :parameters   (?player - player ?from - tile ?to - tile ?key - key)
    :precondition (and  (haveObject ?key)
                        (atTile ?player ?from)
                        (passage ?from ?to)
                  )
    :effect (and  (not (atTile ?player ?from))
                  (not (haveObject ?key)) 
                  (atTile ?player ?to)
                  (when (not(visited ?to)) (visited ?to))
            )
  )

  (:action throwBomb
    ;; Joga uma bomba no tile (?tile) que explode em cruz (+), matando o minotauro
    ;; é obrigatório o agente ter a bomba e o minotauro estar vivo ainda
    :parameters (?tile - tile ?bomb - bomb ?minotaur - minotaur ?player - player ?pTile - tile)
    :precondition (and  (haveObject ?bomb)
                        (isAlive ?minotaur)
                        (atTile ?player ?pTile)
                        (exists (?pNeighbour - tile)
                                (and  (neighbour ?pTile ?pNeighbour)
                                      (neighbour ?pNeighbour ?tile)
                                )
                        )
                        (or (atTile ?minotaur ?tile)
                            (exists (?mNeighbour - tile) 
                                    (and  (neighbour ?tile ?mNeighbour)
                                          (atTile ?minotaur ?mNeighbour)
                                    )
                            )
                        ) 
                  )
    :effect (and  (not  (haveObject ?bomb))
                  (not  (isAlive ?minotaur))
            )
  )

)

; problem
(define (problem maze)
	
	(:domain minotaur-maze)

	(:objects
		l1c1 - tile
		
		minotaur - minotaur
		l1c3 - tile		
		player - player
		l2c1 - tile		l2c2 - tile		l2c3 - tile		l3c1 - tile
		exit - tile		
		bomb - bomb
			
	)

	(:init
		(neighbour l1c1 l2c1)	
		(neighbour l1c3 l2c3)	
		(neighbour l2c1 l1c1)	(neighbour l2c1 l3c1)	(neighbour l2c1 l2c2)	
		(neighbour l2c2 l2c1)	(neighbour l2c2 l2c3)	
		(neighbour l2c3 l1c3)	(neighbour l2c3 l2c2)	
		(neighbour l3c1 l2c1)	(neighbour l3c1 exit)	
		(neighbour exit l3c1)	
		(visited l1c3)	
		(tileSafe l1c1)	
		(tileSafe l1c3)	
		(tileSafe l2c1)	
		(tileSafe l2c2)	
		(tileSafe l2c3)	
		(tileSafe l3c1)	
		(tileSafe exit)	
		(atTile player l1c3)	
		(atTile minotaur l2c1)	
		(isAlive player)	
		(isAlive minotaur)	
		(haveObject bomb)	
		
	)

	(:goal
		(and (atTile player exit) )
	)
)

; plan
1. (throwbomb l2c2 bomb minotaur player l1c3)
   deleted: (haveobject bomb) (isalive minotaur)
   goals met: 0 of 1
2. (moveto player l1c3 l2c3 minotaur)
   deleted: (attile player l1c3)
   added: (attile player l2c3) (visited l2c3)
   goals met: 0 of 1
3. (moveto player l2c3 l2c2 minotaur)
   deleted: (attile player l2c3)
   added: (attile player l2c2) (visited l2c2)
   goals met: 0 of 1
4. (moveto player l2c2 l2c1 minotaur)
   deleted: (attile player l2c2)
   added: (attile player l2c1) (visited l2c1)
   goals met: 0 of 1
5. (moveto player l2c1 l3c1 minotaur)
   deleted: (attile player l2c1)
   added: (attile player l3c1) (visited l3c1)
   goals met: 0 of 1
6. (moveto player l3c1 exit minotaur)
   deleted: (attile player l3c1)
   added: (attile player exit) (visited exit)
   goals met: 1 of 1
